"""
多行注释
"""
'''
多行注释
'''
# 单行注释

# 三元运算符
# a = 6
# b = 1 if a > 10 else 0
# print (b)

# 查看python关键词
import keyword
# print(keyword.kwlist)

# 基本数据类型
""" 
一、数字 Number
1.整型 int (正数，负数)
2.浮点型 float
3.布尔型 bool
4.复数 complex
"""
a, b, c, d = 1, 0.1, True, 0.1 + 1j
# print('a的类型：', type(a))
# print('b的类型：', type(b))
# print('c的类型：', type(c))
# print('d的类型：', type(d))

# # 转换成整型 int()  
# print('int()：', int(1.333), '',type(int(1.333)))

# # 求绝对值 abs()
# print('abs()：', abs(-120), '', type(abs(-120)))
# print('abs()：', abs(-120.1), '', type(abs(-120.1)))

# # 取幂 pow(底数, 指数)  
# print('pow()：', pow(2, 3), '', type(pow(2, 3)))  # 2的3次方

# # 转换成浮点型 float()
# print('float()：', float(1), '', type(float(1)))

# # 四舍五入 round(数字, 位数)
# print('round()：', round(1.22222, 3), '', type(round(1.22222, 3)))

# # 求和 sum()
# print('sum()：', sum([1, 2, 3]), '', type(sum([1, 2, 3])))

# # 最小值 min()
# print('min()：', min([1, 2, 3]), '', type(min([1, 2, 3])))

# # 最大值 max()
# print('max()：', max([1, 2, 3]), '', type(max([1, 2, 3])))

''' 算术操作符
加：“+”   减：“-”  乘：“*”  除：“/”  取模：“%”  整除：“//”  取幂：“**”  '''
# print("运算符：加（+）".center(30, '-'))
# print('1 + 2 =', 1+2)
#
# print("运算符：减（-）".center(30, '-'))
# print('2 - 1 =', 2-1)
#
# print("运算符：乘（*）".center(30, '-'))
# print('1 * 2 =', 1*2)
#
# print("运算符：除（/）".center(30, '-'))
# print('4 / 2 =', 4/2)
#
# print("运算符：取模（%）".center(30, '-'))
# print('5 % 2 =', 5 % 2)
#
# print("运算符：整除（//）".center(30, '-'))
# print('5 // 2 =', 5//2)
#
# print("运算符：取幂（**）".center(30, '-'))
# print('2**3 =', 2**3)

''' 比较操作符  （“==”对比的是值，“is”对比的是地址）  返回结果为布尔类型
大于：“>”  大于等于：“>=”  小于：“<”  小于等于：“<=”  等于：“==”  不等于：“!=”  '''
print("比较符：大于（>）".center(30, '-'))
if 1 > 2:
    print("True")
else:
    print("False")

''' 增强赋值操作符
加后赋值：“+=”  减后赋值：“-=”  乘后赋值：“*=”  除后赋值：“/=”  模后赋值：“%=”  取幂后赋值：“**=”  整除后赋值：“//=”
与后赋值：“&=”  或后赋值：“|=”  异或后赋值：“^=”  左移后赋值：“<<=”  右移后赋值：“>>=” '''

''' 逻辑操作符
and  or  not   '''

''' 位操作符 （仅对数字操作）
与：“&”  或：“|”  异或：“^”  左移：“<<”  右移：“>>”  取反：“~”  '''

''' 成员操作符
in   not in  '''

''' 身份操作符  （“==”对比的是值，“is”对比的是地址）
is   is not  '''

''' 运算符运算次序
括号 -> 函数 -> 算术运算 -> 关系运算 -> 逻辑运算  '''

"""
二、字符串 String 
用英文单引号（''），双引号（""），三单引号（''' '''），三双引号（""" """）引起来的内容，遇到特殊字符采用（"\"）进行转义
"""

''' 字符串占位
数字：“%d”  字符串：“%s“  浮点型：“%f”  
'''
s = ('我叫%s，今年%d岁，存款：%f元' % ("timi", 18, 5))
# print(s)

''' 前缀字符
换行：“\n” 制表符（tab）:"\t"  VT100码前缀：“\033[”
'''
# print('你好\n我叫timi')
# print('你好\t我叫timi')
# print('\033[31m这是红色，\033[32m这是绿色')

''' 转成字符串：str() '''
# print('str()：', str(123), '', type(str(123)))

''' 截取字符串 '''
r = '1234567890'
# print(r[1:7])

'''  '''
